package com.jaaaelu.gzw.clean_code.comments;

public class C4_0 {
    //  别给糟糕的代码加注释——重新写吧

    //  什么也比不上放置良好注释来得有用。什么也不会比乱七八糟的注释更有本事搞乱一个模块。什么也不会比陈旧、提供错误信息
    //  的注释更有破坏性

    //  作者认为，若编程语言足够有用，或者我么长于用这些语言来表达意图，就不那么需要注释——也许根本不需要
    //  注释的恰当作用是弥补我们在用代码表达意图时遭遇的失败
    //  作者认为，注释总是一种失败，就是因为我们总无法找到不用注释就能表达自我的方法

    //  如果你发现自己需要写注释的时候，你可以再想想看是否有办法翻盘（利用代码表达自己的意图）

    //  注释存在的时间越久，就离其所描述的代码越远（可能存在代码改了注释忘记修改的情况），所以在维护代码的时候，注释也需
    //  要同时维护

    //  注释要准确，作者认为不准确的注释要比没注释坏的多

    //  真正能表达意图的最终还是代码，只有代码能诚实的告诉你它在干什么，所以，作者认为尽管有时也需要注释，我们也该多花心
    //  思尽量减少注释
}
